# mqjiEn_US.properties
# Messages produced by the Websphere MQ Java interface classes
# (shared by bindings and by client)
# Messages beginning with MQJI are explanations for exceptions
# Messages beginning with MQJE are errors
#
# From class MQDistributionList
#
1=MQJI001 : L'objet gestionnaire de files d'attente \u00e9tait nul.
2=MQJI002 : Pas de connexion \u00e0 un gestionnaire de files d'attente.
3=MQJI003 : Aucun enregistrement d'objet fourni.
4=MQJI004 : Aucun enregistrement de r\u00e9ponse fourni.
5=MQJI005 : Le nombre d'enregistrements de r\u00e9ponse fourni est insuffisant.
6=MQJI006 : Un enregistrement de r\u00e9ponse ou d'objet \u00e9tait nul.
7=MQJI007 : Le param\u00e8tre openResponse \u00e9tait nul.
8=MQJI008 : Message nul transmis en insertion.
9=MQJI009 : Options de message nulles transmises en insertion.
10=MQJI010 : Le nombre de suivis de message et d'enregistrements r\u00e9ponse ne correspondent pas.
11=MQJI011 : La liste de distribution a \u00e9t\u00e9 ferm\u00e9e.
#
# From class MQEnvironment
#
12=Client Websphere MQ pour Java v5.3
#
# From class MQGetMessageOptions
#
13=MQJI013 : Num\u00e9ro de version non pris en charge - {0}
14=MQJI014 : Donn\u00e9es re\u00e7ues du gestionnaire de files d'attente insuffisantes.
15=MQJI015 : Label erron\u00e9 : {0}
#
# From class MQManagedObject
#
16=MQJI016 : L'objet a \u00e9t\u00e9 ferm\u00e9.
17=MQJI017 : Aucun s\u00e9lecteur indiqu\u00e9.
#
# From class MQMD
#
18=MQJI015 : Label erron\u00e9 : {0}
19=MQJI018 : Erreur de copie de tableau dans MQMD
#
# From class MQMessage
#
20=MQJI019 : Cha\u00eene UTF mal form\u00e9e dans MQMessage::readLine
21=MQJI020 : Page de codes non prise en charge : {0}
22=MQJI021 : Erreur d'index de cha\u00eene lors de la conversion de la page de codes
23=MQJI015 : Label erron\u00e9 : {0}
#
# From class MQOD
#
24=MQJI022 : Le nombre d'enregistrements d'objet et de r\u00e9ponse ne correspondent pas.
#
# From class MQPutMessageOptions
#
25=MQJI023 : Objet MQMessageTracker fourni nul
#
# From class MQMessageTracker
#
26=MQJI024 : Erreur de copie de tableau dans MQMessageTracker
#
# From class MQQueue
#
27=MQJI025 : MQMessage nul transmis pour extraction
28=MQJI026 : Options MQGetMessageOptions nulles transmises pour extraction
29=MQJI027 : La file d'attente a \u00e9t\u00e9 ferm\u00e9e.
30=MQJI028 : MQMessage nul transmis en insertion
31=MQJI029 : MQPutMessageOptions nul transmis en insertion
#
# From class MQQueueManager
#
32=MQJI030 : Le gestionnaire de files d'attente ne prend pas en charge les listes de distribution.
#
# From class MQS390FloatSupport
#
33=MQJI031 : Valeur hors plage pour virgule flottante S/390 \u00e0 double pr\u00e9cision
#
# From class MQS390PackedDecimalSupport
#
34=MQJI032 : Signe de quartet non valide dans les donn\u00e9es au format d\u00e9cimal condens\u00e9
35=MQJI033 : Chiffre au format d\u00e9cimal condens\u00e9 hors de la plage 0-9
36=MQJI034 : Valeur hors plage pour les donn\u00e9es au format d\u00e9cimal condens\u00e9 abr\u00e9g\u00e9 (+/-999)
37=MQJI035 : Valeur hors plage pour les donn\u00e9es au format d\u00e9cimal condens\u00e9 entier (+/-9999999)
38=MQJI036 : Valeur hors plage pour les donn\u00e9es au format d\u00e9cimal condens\u00e9 long (0+/-999999999999999)
#
# From class MQException
#
39=MQJE001 : Code ach\u00e8vement {0}, raison {1}
40=MQJE001 : MQException : Code ach\u00e8vement {0}, raison {1}\n\
{2}
#
# Messages produced by client only classes...
#
41=MQJI037 : Une erreur s''est produite lors de l''appel d''API Websphere MQ - code anomalie {0}
42=MQJI038 : Erreur interne inattendue lors du traitement de l'index de cha\u00eene
43=MQJE002 : Flux en sortie de socket nul
44=MQJE003 : Erreur d'E-S lors de la transmission de la m\u00e9moire tampon de messages
45=MQJE004 : Flux en entr\u00e9e de socket nul
46=MQJE005 : Label TSH introuvable.  Label : {0}
47=MQJE006 : Erreur interne lors de la copie de tableau
48=MQJE007 : Erreur d'E-S lors de la lecture des donn\u00e9es du message
49=MQJE008 : IOException lors de l'envoi du message d'\u00e9tat
50=MQJE009 : Impossible de cr\u00e9er l'en-t\u00eate d'API
51=MQJE010 : H\u00f4te inconnu : {0}
52=MQJE011 : Tentative de connexion au socket refus\u00e9e
53=MQJE012 : Erreur de s\u00e9curit\u00e9 - connexion \u00e0 l''h\u00f4te {0} impossible
54=MQJE013 : Erreur d'acc\u00e8s aux flux de socket
55=MQJE014 : Connexion au point de contr\u00f4le rejet\u00e9e
56=MQJE015 : Erreur lors de la connexion au point de contr\u00f4le
57=MQJE016 : Le gestionnaire de files d''attente MQ a ferm\u00e9 imm\u00e9diatement le canal lors de la connexion.\n\
\Code anomalie de fermeture = {0}
58=MQJE017 : Le gestionnaire de files d''attente MQ a envoy\u00e9 une erreur d''\u00e9tat {0} lors de la connexion.
59=MQJE018 : Erreur de protocole - type de segment inattendu re\u00e7u
60=MQJE019 : Erreur lors de la cr\u00e9ation du segment de donn\u00e9es initial
61=MQJE020 : CCSID non pris en charge par le gestionnaire de files d'attente
62=MQJE021 : Encodage non pris en charge par le gestionnaire de files d'attente
63=MQJE022 : Niveau FAP non pris en charge par le gestionnaire de files d'attente
64=MQJE023 : Echec de la n\u00e9gociation sur le nombre maximal de messages par lot
65=MQJE024 : Valeur de renvoi \u00e0 la ligne de la s\u00e9quence non prise en charge par le gestionnaire de files d'attente
66=MQJE025 : Le canal s''est ferm\u00e9 apr\u00e8s deux changements initiaux.  Code anomalie de fermeture : {0}
67=MQJE026 : Le gestionnaire de files d''attente a envoy\u00e9 l''erreur d''\u00e9tat {0} lors de la connexion.
68=MQJE027 : L''exit de s\u00e9curit\u00e9 du gestionnaire de files d''attente a rejet\u00e9 la connexion avec le code d''erreur {0}.
69=MQJE028 : Le canal s'est ferm\u00e9 lors des \u00e9changes de s\u00e9curit\u00e9.
70=MQJE029 : Type de message inattendu envoy\u00e9 par le gestionnaire de files d'attente
71=MQJE030 : IOException lors des flux de s\u00e9curit\u00e9
72=MQJE031 : Un exit de s\u00e9curit\u00e9 a ferm\u00e9 le canal.
73=MQJE032 : L''exit de s\u00e9curit\u00e9 du gestionnaire de files d''attente a rejet\u00e9 la connexion avec le code anomalie {0}.
74=MQJE033 : Un flux de s\u00e9curit\u00e9 requis n'a pas \u00e9t\u00e9 envoy\u00e9 par le gestionnaire de files d'attente.
75=MQJE034 : Type de message inattendu envoy\u00e9 par le gestionnaire de files d'attente
76=MQJE035 : La taille de transmission maximale n\u00e9goci\u00e9e est trop petite.
77=MQJE036 : Le gestionnaire de files d'attente a rejet\u00e9 la tentative de connexion.
78=MQJE037 : Le gestionnaire de files d'attente \u00e9loign\u00e9 a ferm\u00e9 la connexion.
79=MQJE038 : Type de segment inattendu {0} re\u00e7u
80=MQJE039 : IOException lors de la cr\u00e9ation du flux de donn\u00e9es de connexion
81=MQJE040 : Canal ferm\u00e9 par l'exit
82=MQJE041 : Num\u00e9ro de version non pris en charge - (0)
83=MQJE042 : Label erron\u00e9 : {0}
84=MQJE043 : Donn\u00e9es insuffisantes re\u00e7ues du gestionnaire de files d'attente
85=MQJE044 : Erreur de copie de tableau dans MQMD
86=MQJE045 : Cha\u00eene UTF mal form\u00e9e
87=MQJE046 : Page de codes non prise en charge : {0}
88=MQJE047 : Erreur d'index de cha\u00eene lors de la conversion de la page de codes
89=MQJE048 : Signe de quartet non valide dans les donn\u00e9es au format d\u00e9cimal condens\u00e9
90=MQJE049 : Chiffre au format d\u00e9cimal condens\u00e9 hors de la plage 0-9
91=MQJE050 : Valeur hors plage pour les donn\u00e9es au format d\u00e9cimal condens\u00e9 abr\u00e9g\u00e9 (+/-999)
92=MQJE051 : Valeur hors plage pour les donn\u00e9es au format d\u00e9cimal condens\u00e9 entier (+/-9999999)
93=MQJE052 : Valeur hors plage pour les donn\u00e9es au format d\u00e9cimal condens\u00e9 long (0+/-999999999999999)
94=Liaisons de langage Websphere MQ pour Java v5.3
95=MQJE053: Les liaisons de langage Websphere MQ pour la biblioth\u00e8que Java n'ont pas pu \u00eatre charg\u00e9s.
96=MQJE054 : Le gestionnaire de files d'attente ne prend pas en charge les listes de distribution.
97=MQJE055 : Le gestionnaire de files d'attente ne prend pas en charge les structures d'API WebSphere MQ version 2.
98=MQJE056 : Echec de la n\u00e9gociation initiale
99=MQJE057 : Le canal s'est ferm\u00e9 lors des \u00e9changes de s\u00e9curit\u00e9.
100=MQJE058 : Nombre d'enregistrements d'objet ou de r\u00e9ponse non valide
101=MQJE059 : Erreur d'index de cha\u00eene
102=MQJE060 : Classe {0} introuvable
103=MQJE061 : Zone {0} introuvable
104=MQJE062 : M\u00e9thode {0} introuvable
#
# Messages used by MQManagedConnectionJ11, ManagedConnectionFactories
# and MQManagedConnectionMetaData
#
105=MQJI039 : Objet ConnectionRequestInfo non valide
106=MQJI040 : MQManagedConnection d\u00e9j\u00e0 supprim\u00e9
107=MQJI041 : La m\u00e9thode {0} n''est pas prise en charge par les classes Websphere MQ pour Java.
108=MQJI042 : MQManagedConnection non r\u00e9utilisable
#
# Messages from MQManagedConnectionMetaData
#
109=IBM Websphere MQ
110=Niveau de commande {0}
#
# Messages from MQXAi
#
111=Le gestionnaire de s\u00e9curit\u00e9 a emp\u00each\u00e9 l'acc\u00e8s \u00e0 la biblioth\u00e8que de m\u00e9thodes natives pour le support XA MQ.
112=Echec de chargement de la biblioth\u00e8que de m\u00e9thodes natives pour le support XA MQ.
#
# Messages from MQXAResource
#
113=Echec de xa_open
114=Echec de l'op\u00e9ration XA, voir code d'erreur
115=XAResource ferm\u00e9e

#
# Messages produced by com.ibm.mq.MQMsg2
#
116=MQJE063: Jeux de caract\u00e8res non g\u00e9r\u00e9 {0}
117=MQJE064: Version de la structure MQMD non g\u00e9r\u00e9e {0}
118=MQJE065: \u00c9tat interne incoh\u00e9rent d\u00e9tect\u00e9

# message when server doesn't support client XA
119=connexion client XA non prise en charge

#
# Messages produced via SSL options on a client connection
#
120=MQJE066: {0} a fourni un type d''objet non pris en charge
121=MQJE067: Le nom d''homologue {0} ne correspond pas au nom requis {1}
122=MQJE068: Le certificat de serveur n'a pas \u00e9t\u00e9 r\u00e9voqu\u00e9
123=MQJE069: Impossible de contacter CertStore
124=MQJE070: Erreur de protocole SSL : Canal non configur\u00e9 pour SSL?
