# mqjiEn_US.properties
# Messages produced by the Websphere MQ Java interface classes
# (shared by bindings and by client)
# Messages beginning with MQJI are explanations for exceptions
# Messages beginning with MQJE are errors
#
# From class MQDistributionList
#
1=MQJI001: O objeto gerenciador de filas era nulo.
2=MQJI002: N\u00e3o conectado a um gerenciador de filas.
3=MQJI003: Nenhum registro de objeto fornecido.
4=MQJI004: Nenhum registro de resposta fornecido.
5=MQJI005: Foram fornecidos registros de respostas insuficientes.
6=MQJI006: Um registro de objeto ou resposta era nulo.
7=MQJI007: O par\u00e2metro openResponse era nulo.
8=MQJI008: Foi colocada mensagem nula.
9=MQJI009: Foram colocadas op\u00e7\u00f5es de mensagens nulas.
10=MQJI010: Os n\u00fameros de rastreadores de mensagens e de registros de respostas n\u00e3o correspondem.
11=MQJI011: A lista de distribui\u00e7\u00e3o foi fechada.
#
# From class MQEnvironment
#
12=WebSphere MQ Client for Java v5.3
#
# From class MQGetMessageOptions
#
13=MQJI013: N\u00famero de vers\u00e3o n\u00e3o suportada - {0}
14=MQJI014: Dados insuficientes recebidos do gerenciador de filas.
15=MQJI015: Capturador incorreto : {0}
#
# From class MQManagedObject
#
16=MQJI016: O objeto foi fechado.
17=MQJI017: Nenhum seletor especificado.
#
# From class MQMD
#
18=MQJI015: Capturador incorreto : {0}
19=MQJI018: Erro de c\u00f3pia de matriz em MQMD
#
# From class MQMessage
#
20=MQJI019: Cadeia UTF malformada em MQMessage::readLine
21=MQJI020: Conjunto de c\u00f3digos n\u00e3o suportado : {0}
22=MQJI021: Ocorreu um erro de \u00edndice de cadeia durante a convers\u00e3o do conjunto de c\u00f3digos
23=MQJI015: Capturador incorreto : {0}
#
# From class MQOD
#
24=MQJI022: O n\u00famero de registros de objetos e de respostas n\u00e3o corresponde.
#
# From class MQPutMessageOptions
#
25=MQJI023: Objeto MQMessageTracker fornecido nulo
#
# From class MQMessageTracker
#
26=MQJI024: Erro de c\u00f3pia de matriz em MQMessageTracker
#
# From class MQQueue
#
27=MQJI025: MQMessage nula transmitida passada para obter
28=MQJI026: MQGetMessageOptions nula passado para obter
29=MQJI027: A fila foi fechada
30=MQJI028: MQMessage nula colocada
31=MQJI029: MQPutMessageOptions nula colocada
#
# From class MQQueueManager
#
32=MQJI030: O gerenciador de filas n\u00e3o suporta listas de distribui\u00e7\u00e3o.
#
# From class MQS390FloatSupport
#
33=MQJI031: N\u00famero fora do intervalo para Float S/390 de precis\u00e3o dupla
#
# From class MQS390PackedDecimalSupport
#
34=MQJI032: Nibble de sinal inv\u00e1lido no decimal compactado
35=MQJI033: D\u00edgito de Decimal Compactado fora do intervalo 0-9
36=MQJI034: Fora do intervalo para decimal compactado curto (+/-999)
37=MQJI035: Fora do intervalo para decimal compactado inteiro (+/-9999999)
38=MQJI036: Fora do intervalo para decimal compactado longo (0+/-999999999999999)
#
# From class MQException
#
39=MQJE001: C\u00f3digo de Conclus\u00e3o {0}, Raz\u00e3o {1}
40=MQJE001: Ocorreu uma MQException: C\u00f3digo de Conclus\u00e3o {0}, Raz\u00e3o {1}\n\
{2}
#
# Messages produced by client only classes...
#
41=MQJI037: Ocorreu um erro durante a chamada de API do WebSphere MQ - c\u00f3digo de raz\u00e3o {0}
42=MQJI038: Ocorreu um erro interno inesperado durante o processamento de \u00edndice da cadeia
43=MQJE002: O fluxo de sa\u00edda do soquete era nulo
44=MQJE003: Buffer de mensagem de transmiss\u00e3o de erro de E/S
45=MQJE004: O fluxo de entrada de soquete era nulo
46=MQJE005: Capturador TSH n\u00e3o encontrado. O capturador era {0}
47=MQJE006: Erro interno durante a c\u00f3pia de matriz
48=MQJE007: Dados da mensagem de leitura de erro de E/S
49=MQJE008: IOException ao enviar mensagem de status
50=MQJE009: Falha ao construir o cabe\u00e7alho de API
51=MQJE010: Host desconhecido : {0}
52=MQJE011: Tentativa de conex\u00e3o de soquete recusada
53=MQJE012: Erro de seguran\u00e7a - imposs\u00edvel conectar-se ao host {0}
54=MQJE013: Erro ao acessar os fluxos de soquete
55=MQJE014: O Ponto de Controle rejeitou a conex\u00e3o
56=MQJE015: Erro ao conectar ao Ponto de Controle
57=MQJE016: O gerenciador de filas MQ fechou o canal imediatamente durante a conex\u00e3o\n\
\Raz\u00e3o do fechamento = {0}
58=MQJE017: O gerenciador de filas MQ enviou o erro de status {0} durante a conex\u00e3o
59=MQJE018: Erro de protocolo - tipo de segmento inesperado recebido
60=MQJE019: Erro ao criar segmento de dados inicial
61=MQJE020: CCSID n\u00e3o suportado pelo gerenciador de filas
62=MQJE021: Codifica\u00e7\u00e3o n\u00e3o suportada pelo gerenciador de filas
63=MQJE022: N\u00edvel FAP n\u00e3o suportado pelo gerenciador de filas
64=MQJE023: Falha de negocia\u00e7\u00e3o nas mensagens m\u00e1ximas por batch
65=MQJE024: Valor de agrupamento de seq\u00fc\u00eancias n\u00e3o suportado pelo gerenciador de filas
66=MQJE025: Canal fechado ap\u00f3s duas altera\u00e7\u00f5es iniciais. Raz\u00e3o do fechamento {0}
67=MQJE026: O gerenciador de filas enviou o erro de status {0} durante a conex\u00e3o
68=MQJE027: A sa\u00edda de seguran\u00e7a do gerenciador de filas rejeitou a conex\u00e3o com o c\u00f3digo de erro {0}
69=MQJE028: Canal fechado durante as trocas de seguran\u00e7a
70=MQJE029: Tipo de mensagem inesperado enviado pelo gerenciador de filas
71=MQJE030: IOException durante os fluxos de seguran\u00e7a
72=MQJE031: A sa\u00edda de seguran\u00e7a fechou o canal
73=MQJE032: A sa\u00edda de seguran\u00e7a do gerenciador de filas rejeitou a conex\u00e3o com a raz\u00e3o do c\u00f3digo {0}
74=MQJE033: Um fluxo de seguran\u00e7a necess\u00e1rio n\u00e3o foi enviado pelo gerenciador de filas
75=MQJE034: Tipo de mensagem inesperado enviado pelo gerenciador de filas
76=MQJE035: O tamanho de transmiss\u00e3o m\u00e1xima negociado \u00e9 muito pequeno
77=MQJE036: O gerenciador de filas rejeitou a tentativa de conex\u00e3o
78=MQJE037: O gerenciador de filas remoto fechou a conex\u00e3o
79=MQJE038: Tipo de segmento inesperado {0} recebido
80=MQJE039: IOException ao construir fluxo de dados de conex\u00e3o
81=MQJE040: Canal fechado pela sa\u00edda
82=MQJE041: N\u00famero de vers\u00e3o n\u00e3o suportado - (0)
83=MQJE042: Capturador incorreto : {0}
84=MQJE043: Dados insuficientes recebidos do gerenciador de filas
85=MQJE044: Erro de c\u00f3pia de matriz em MQMD
86=MQJE045: Cadeia UTF malformada
87=MQJE046: Conjunto de c\u00f3digos n\u00e3o suportado : {0}
88=MQJE047: Ocorreu um erro de \u00edndice de cadeia durante a convers\u00e3o do conjunto de c\u00f3digos
89=MQJE048: Nibble de sinal inv\u00e1lido no decimal compactado
90=MQJE049: D\u00edgito de Decimal Compactado fora do intervalo 0-9
91=MQJE050: Fora do intervalo para decimal compactado curto (+/-999)
92=MQJE051: Fora do intervalo para decimal compactado inteiro (+/-9999999)
93=MQJE052: Fora do intervalo para decimal compactado longo (0+/-999999999999999)
94=WebSphere MQ Bindings para Java v5.3
95=MQJE053: N\u00e3o foi poss\u00edvel carregar a biblioteca do WebSphere MQ Bindings para Java
96=MQJE054: O gerenciador de filas n\u00e3o suporta listas de distribui\u00e7\u00e3o
97=MQJE055: O gerenciador de filas n\u00e3o suporta estruturas da API do WebSphere MQ vers\u00e3o 2
98=MQJE056: Falha de negocia\u00e7\u00e3o inicial
99=MQJE057: Canal fechado durante as trocas de seguran\u00e7a
100=MQJE058: N\u00famero inv\u00e1lido de registros de objetos ou respostas
101=MQJE059: Erro de \u00edndice de cadeia
102=MQJE060: Imposs\u00edvel procurar a classe {0}
103=MQJE061: Imposs\u00edvel procurar o campo {0}
104=MQJE062: Imposs\u00edvel procurar o m\u00e9todo {0}
#
# Messages used by MQManagedConnectionJ11, ManagedConnectionFactories
# and MQManagedConnectionMetaData
#
105=MQJI039: Objeto ConnectionRequestInfo inv\u00e1lido
106=MQJI040: MQManagedConnection j\u00e1 destru\u00eddo
107=MQJI041: O m\u00e9todo {0} n\u00e3o \u00e9 suportado pelas Classes do WebSphere MQ para Java
108=MQJI042: MQManagedConnection n\u00e3o reutiliz\u00e1vel
#
# Messages from MQManagedConnectionMetaData
#
109=IBM WebSphere MQ
110=N\u00edvel de Comando {0}
#
# Messages from MQXAi
#
111=O gerenciador de seguran\u00e7a evitou o acesso \u00e0 biblioteca de m\u00e9todos nativos para suporte ao MQ XA.
112=Falha ao carregar a biblioteca de m\u00e9todos nativos para suporte ao MQ XA.
#
# Messages from MQXAResource
#
113=Falha no xa_open
114=Falha na opera\u00e7\u00e3o do XA, consulte o C\u00f3digo de erro
115=XAResource fechado

#
# Messages produced by com.ibm.mq.MQMsg2
#
116=MQJE063: N\u00e3o suportado o conjunto de caracteres {0}
117=MQJE064: N\u00e3o suportada a vers\u00e3o da estrutura do MQMD {0}
118=MQJE065: Estado interno inconsistente detectado

# message when server doesn't support client XA
119=conex\u00e3o de cliente n\u00e3o ativada por XA

#
# Messages produced via SSL options on a client connection
#
120=MQJE066: {0} fornecido como um tipo de objeto n\u00e3o suportado
121=MQJE067: O nome do n\u00edvel de protocolo {0} n\u00e3o corresponde ao nome solicitado {1}
122=MQJE068: O certificado do servidor foi revogado
123=MQJE069: Imposs\u00edvel entrar em contato com CertStore
124=MQJE070: Erro de Protocolo SSL: Canal n\u00e3o configurado para SSL?
