# mqjiEn_US.properties
# Messages produced by the Websphere MQ Java interface classes
# (shared by bindings and by client)
# Messages beginning with MQJI are explanations for exceptions
# Messages beginning with MQJE are errors
#
# From class MQDistributionList
#
1=MQJI001: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u30fb\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u30cc\u30eb\u3067\u3057\u305f\u3002
2=MQJI002: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306b\u63a5\u7d9a\u3057\u3066\u3044\u307e\u305b\u3093\u3002
3=MQJI003: \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30ec\u30b3\u30fc\u30c9\u304c\u63d0\u4f9b\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
4=MQJI004: \u5fdc\u7b54\u30ec\u30b3\u30fc\u30c9\u304c\u63d0\u4f9b\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
5=MQJI005: \u5341\u5206\u306a\u5fdc\u7b54\u30ec\u30b3\u30fc\u30c9\u304c\u63d0\u4f9b\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
6=MQJI006: \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u307e\u305f\u306f\u5fdc\u7b54\u30ec\u30b3\u30fc\u30c9\u304c\u30cc\u30eb\u3067\u3057\u305f\u3002
7=MQJI007: openResponse \u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u304c\u30cc\u30eb\u3067\u3057\u305f\u3002
8=MQJI008: \u30cc\u30eb\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u66f8\u304d\u8fbc\u307f\u7528\u306b\u6e21\u3055\u308c\u307e\u3057\u305f\u3002
9=MQJI009: \u30cc\u30eb\u30fb\u30d7\u30c3\u30c8\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30aa\u30d7\u30b7\u30e7\u30f3\u304c\u66f8\u304d\u8fbc\u307f\u7528\u306b\u6e21\u3055\u308c\u307e\u3057\u305f\u3002
10=MQJI010: \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30c8\u30e9\u30c3\u30ab\u30fc\u3068\u5fdc\u7b54\u30ec\u30b3\u30fc\u30c9\u306e\u6570\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002
11=MQJI011: \u914d\u5e03\u30ea\u30b9\u30c8\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002
#
# From class MQEnvironment
#
12=Websphere MQ Client for Java v5.3
#
# From class MQGetMessageOptions
#
13=MQJI013: \u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u30d0\u30fc\u30b8\u30e7\u30f3\u756a\u53f7 - {0}
14=MQJI014: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304b\u3089\u53d7\u4fe1\u3057\u305f\u30c7\u30fc\u30bf\u304c\u4e0d\u5341\u5206\u3067\u3059\u3002
15=MQJI015: \u8aa4\u3063\u305f\u76ee\u5370: {0}
#
# From class MQManagedObject
#
16=MQJI016: \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002
17=MQJI017: \u30bb\u30ec\u30af\u30bf\u30fc\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
#
# From class MQMD
#
18=MQJI015: \u8aa4\u3063\u305f\u76ee\u5370: {0}
19=MQJI018: MQMD \u3067\u306e\u914d\u5217\u30b3\u30d4\u30fc\u30fb\u30a8\u30e9\u30fc
#
# From class MQMessage
#
20=MQJI019: MQMessage \u306e\u8aa4\u3063\u305f UTF \u30b9\u30c8\u30ea\u30f3\u30b0::readLine
21=MQJI020: \u30b5\u30dd\u30fc\u30c8\u3055\u308c\u306a\u3044\u30b3\u30fc\u30c9\u30fb\u30bb\u30c3\u30c8: {0}
22=MQJI021: \u30b3\u30fc\u30c9\u30fb\u30bb\u30c3\u30c8\u5909\u63db\u4e2d\u306b\u30b9\u30c8\u30ea\u30f3\u30b0\u7d22\u5f15\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
23=MQJI015: \u8aa4\u3063\u305f\u76ee\u5370: {0}
#
# From class MQOD
#
24=MQJI022: \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304a\u3088\u3073\u5fdc\u7b54\u30ec\u30b3\u30fc\u30c9\u306e\u6570\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093
#
# From class MQPutMessageOptions
#
25=MQJI023: \u30cc\u30eb MQMessageTracker \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u63d0\u4f9b\u3055\u308c\u307e\u3057\u305f
#
# From class MQMessageTracker
#
26=MQJI024: MQMessageTracker \u3067\u306e\u914d\u5217\u30b3\u30d4\u30fc\u30fb\u30a8\u30e9\u30fc
#
# From class MQQueue
#
27=MQJI025: \u30cc\u30eb MQMessage \u304c\u8aad\u307f\u53d6\u308a\u7528\u306b\u6e21\u3055\u308c\u307e\u3057\u305f
28=MQJI026: \u30cc\u30eb MQGetMessageOptions \u304c\u8aad\u307f\u53d6\u308a\u7528\u306b\u6e21\u3055\u308c\u307e\u3057\u305f
29=MQJI027: \u30ad\u30e5\u30fc\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002
30=MQJI028: \u30cc\u30eb MQMessage \u304c\u66f8\u304d\u8fbc\u307f\u7528\u306b\u6e21\u3055\u308c\u307e\u3057\u305f
31=MQJI029: \u30cc\u30eb MQPutMessageOptions \u304c\u66f8\u304d\u8fbc\u307f\u7528\u306b\u6e21\u3055\u308c\u307e\u3057\u305f
#
# From class MQQueueManager
#
32=MQJI030: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u914d\u5e03\u30ea\u30b9\u30c8\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
#
# From class MQS390FloatSupport
#
33=MQJI031: \u6570\u5024\u304c\u500d\u7cbe\u5ea6 S/390 \u6d6e\u52d5\u5c0f\u6570\u70b9\u306e\u7bc4\u56f2\u3092\u8d85\u3048\u3066\u3044\u307e\u3059
#
# From class MQS390PackedDecimalSupport
#
34=MQJI032: \u30d1\u30c3\u30af 10 \u9032\u6570\u306b\u7121\u52b9\u306a\u7b26\u53f7\u30cb\u30d6\u30eb\u304c\u3042\u308a\u307e\u3059
35=MQJI033: \u30d1\u30c3\u30af 10 \u9032\u6570\u306e\u6841\u6570\u304c\u7bc4\u56f2 0-9 \u3092\u8d85\u3048\u3066\u3044\u307e\u3059
36=MQJI034: \u77ed\u7cbe\u5ea6\u30d1\u30c3\u30af 10 \u9032\u6570\u304c\u7bc4\u56f2 (+/-999) \u3092\u8d85\u3048\u3066\u3044\u307e\u3059
37=MQJI035: \u6574\u6570\u30d1\u30c3\u30af 10 \u9032\u6570\u304c\u7bc4\u56f2 (+/-9999999) \u3092\u8d85\u3048\u3066\u3044\u307e\u3059
38=MQJI036: \u9577\u7cbe\u5ea6\u30d1\u30c3\u30af 10 \u9032\u6570\u304c\u7bc4\u56f2 (0+/-999999999999999) \u3092\u8d85\u3048\u3066\u3044\u307e\u3059
#
# From class MQException
#
39=MQJE001: \u5b8c\u4e86\u30b3\u30fc\u30c9 {0}\u3001\u7406\u7531 {1}
40=MQJE001: MQException \u304c\u767a\u751f\u3057\u307e\u3057\u305f: \u5b8c\u4e86\u30b3\u30fc\u30c9 {0}\u3001\u7406\u7531 {1}\u00a5n\u00a5
{2}
#
# Messages produced by client only classes...
#
41=MQJI037: Websphere MQ API \u547c\u3073\u51fa\u3057\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f - \u7406\u7531\u30b3\u30fc\u30c9 {0}
42=MQJI038: \u30b9\u30c8\u30ea\u30f3\u30b0\u7d22\u5f15\u306e\u51e6\u7406\u4e2d\u306b\u4e88\u671f\u3057\u306a\u3044\u5185\u90e8\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
43=MQJE002: \u30bd\u30b1\u30c3\u30c8\u51fa\u529b\u30b9\u30c8\u30ea\u30fc\u30e0\u304c\u30cc\u30eb\u3067\u3057\u305f
44=MQJE003: \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d0\u30c3\u30d5\u30a1\u30fc\u4f1d\u9001\u4e2d\u306e\u5165\u51fa\u529b\u30a8\u30e9\u30fc
45=MQJE004: \u30bd\u30b1\u30c3\u30c8\u5165\u529b\u30b9\u30c8\u30ea\u30fc\u30e0\u304c\u30cc\u30eb\u3067\u3057\u305f
46=MQJE005: TSH \u76ee\u5370\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u76ee\u5370\u306f {0} \u3067\u3057\u305f
47=MQJE006: \u914d\u5217\u30b3\u30d4\u30fc\u4e2d\u306e\u5185\u90e8\u30a8\u30e9\u30fc
48=MQJE007: \u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30c7\u30fc\u30bf\u8aad\u307f\u53d6\u308a\u6642\u306e\u5165\u51fa\u529b\u30a8\u30e9\u30fc
49=MQJE008: \u72b6\u6cc1\u30e1\u30c3\u30bb\u30fc\u30b8\u9001\u4fe1\u4e2d\u306e IOException
50=MQJE009: API \u30d8\u30c3\u30c0\u30fc\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f
51=MQJE010: \u4e0d\u660e\u306a\u30db\u30b9\u30c8: {0}
52=MQJE011: \u30bd\u30b1\u30c3\u30c8\u63a5\u7d9a\u3092\u884c\u306a\u304a\u3046\u3068\u3057\u307e\u3057\u305f\u304c\u62d2\u5426\u3055\u308c\u307e\u3057\u305f
53=MQJE012: \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30a8\u30e9\u30fc - \u30db\u30b9\u30c8 {0} \u306b\u63a5\u7d9a\u3067\u304d\u307e\u305b\u3093
54=MQJE013: \u30bd\u30b1\u30c3\u30c8\u30fb\u30b9\u30c8\u30ea\u30fc\u30e0\u306e\u30a2\u30af\u30bb\u30b9\u30fb\u30a8\u30e9\u30fc
55=MQJE014: \u5236\u5fa1\u70b9\u304c\u63a5\u7d9a\u3092\u62d2\u5426\u3057\u307e\u3057\u305f
56=MQJE015: \u5236\u5fa1\u70b9\u3078\u306e\u63a5\u7d9a\u30a8\u30e9\u30fc
57=MQJE016: MQ \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306f\u63a5\u7d9a\u4e2d\u306b\u5373\u6642\u306b\u30c1\u30e3\u30cd\u30eb\u3092\u30af\u30ed\u30fc\u30ba\u3057\u307e\u3057\u305f\u00a5n\u00a5
\u30af\u30ed\u30fc\u30ba\u7406\u7531 (\u00a5C) = {0}
58=MQJE017: MQ \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306f\u63a5\u7d9a\u4e2d\u306b\u72b6\u6cc1\u30a8\u30e9\u30fc {0} \u3092\u9001\u4fe1\u3057\u307e\u3057\u305f
59=MQJE018: \u30d7\u30ed\u30c8\u30b3\u30eb\u30fb\u30a8\u30e9\u30fc - \u4e88\u671f\u3057\u306a\u3044\u30bb\u30b0\u30e1\u30f3\u30c8\u30fb\u30bf\u30a4\u30d7\u304c\u53d7\u4fe1\u3055\u308c\u307e\u3057\u305f
60=MQJE019: \u521d\u671f\u30c7\u30fc\u30bf\u30fb\u30bb\u30b0\u30e1\u30f3\u30c8\u4f5c\u6210\u30a8\u30e9\u30fc
61=MQJE020: CCSID \u304c\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306b\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
62=MQJE021: \u30a8\u30f3\u30b3\u30fc\u30c9\u304c\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306b\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
63=MQJE022: FAP \u30ec\u30d9\u30eb\u304c\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306b\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
64=MQJE023: \u30d0\u30c3\u30c1\u3042\u305f\u308a\u306e\u6700\u5927\u30e1\u30c3\u30bb\u30fc\u30b8\u6570\u306b\u95a2\u3059\u308b\u6298\u885d\u306b\u5931\u6557\u3057\u307e\u3057\u305f
65=MQJE024: \u30b7\u30fc\u30b1\u30f3\u30b9\u6298\u308a\u8fd4\u3057\u5024\u304c\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
66=MQJE025: \u30c1\u30e3\u30cd\u30eb\u304c 2 \u3064\u306e\u521d\u671f\u5909\u66f4\u306e\u5f8c\u306b\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f\u3002\u30af\u30ed\u30fc\u30ba\u7406\u7531 {0}
67=MQJE026: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u63a5\u7d9a\u4e2d\u306b\u72b6\u6cc1\u30a8\u30e9\u30fc {0} \u3092\u9001\u4fe1\u3057\u307e\u3057\u305f
68=MQJE027: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u51fa\u53e3\u304c\u30a8\u30e9\u30fc\u30fb\u30b3\u30fc\u30c9 {0} \u3067\u63a5\u7d9a\u3092\u62d2\u5426\u3057\u307e\u3057\u305f
69=MQJE028: \u30c1\u30e3\u30cd\u30eb\u304c\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u4ea4\u63db\u4e2d\u306b\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f
70=MQJE029: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u4e88\u671f\u3057\u306a\u3044\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30bf\u30a4\u30d7\u3092\u9001\u4fe1\u3057\u307e\u3057\u305f
71=MQJE030: \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30d5\u30ed\u30fc\u4e2d\u306e IOException
72=MQJE031: \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u51fa\u53e3\u304c\u30c1\u30e3\u30cd\u30eb\u3092\u30af\u30ed\u30fc\u30ba\u3057\u307e\u3057\u305f
73=MQJE032: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u51fa\u53e3\u304c\u7406\u7531\u30b3\u30fc\u30c9 {0} \u3067\u63a5\u7d9a\u3092\u62d2\u5426\u3057\u307e\u3057\u305f
74=MQJE033: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u5fc5\u8981\u306a\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30d5\u30ed\u30fc\u3092\u9001\u4fe1\u3057\u307e\u305b\u3093\u3067\u3057\u305f
75=MQJE034: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u4e88\u671f\u3057\u306a\u3044\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30bf\u30a4\u30d7\u3092\u9001\u4fe1\u3057\u307e\u3057\u305f
76=MQJE035: \u6298\u885d\u3055\u308c\u305f\u6700\u5927\u4f1d\u9001\u30b5\u30a4\u30ba\u304c\u5c0f\u3055\u3059\u304e\u307e\u3059
77=MQJE036: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u63a5\u7d9a\u3092\u62d2\u5426\u3057\u307e\u3057\u305f
78=MQJE037: \u30ea\u30e2\u30fc\u30c8\u30fb\u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u63a5\u7d9a\u3092\u30af\u30ed\u30fc\u30ba\u3057\u307e\u3057\u305f
79=MQJE038: \u4e88\u671f\u3057\u306a\u3044\u30bb\u30b0\u30e1\u30f3\u30c8\u30fb\u30bf\u30a4\u30d7 {0} \u3092\u53d7\u4fe1\u3057\u307e\u3057\u305f
80=MQJE039: \u63a5\u7d9a\u30c7\u30fc\u30bf\u30fb\u30b9\u30c8\u30ea\u30fc\u30e0\u4f5c\u6210\u4e2d\u306e IOException
81=MQJE040: \u30c1\u30e3\u30cd\u30eb\u304c\u51fa\u53e3\u306b\u3088\u3063\u3066\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f
82=MQJE041: \u30b5\u30dd\u30fc\u30c8\u3055\u308c\u306a\u3044\u30d0\u30fc\u30b8\u30e7\u30f3\u756a\u53f7 - (0)
83=MQJE042: \u8aa4\u3063\u305f\u76ee\u5370: {0}
84=MQJE043: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304b\u3089\u53d7\u4fe1\u3057\u305f\u30c7\u30fc\u30bf\u304c\u4e0d\u5341\u5206\u3067\u3059
85=MQJE044: MQMD \u3067\u306e\u914d\u5217\u30b3\u30d4\u30fc\u30fb\u30a8\u30e9\u30fc
86=MQJE045: \u8aa4\u3063\u305f\u5f62\u5f0f\u306e UTF \u30b9\u30c8\u30ea\u30f3\u30b0
87=MQJE046: \u30b5\u30dd\u30fc\u30c8\u3055\u308c\u306a\u3044\u30b3\u30fc\u30c9\u30fb\u30bb\u30c3\u30c8: {0}
88=MQJE047: \u30b3\u30fc\u30c9\u30fb\u30bb\u30c3\u30c8\u5909\u63db\u4e2d\u306b\u767a\u751f\u3057\u305f\u30b9\u30c8\u30ea\u30f3\u30b0\u7d22\u5f15
89=MQJE048: \u30d1\u30c3\u30af 10 \u9032\u6570\u306b\u7121\u52b9\u306a\u7b26\u53f7\u30cb\u30d6\u30eb\u304c\u3042\u308a\u307e\u3059
90=MQJE049: \u30d1\u30c3\u30af 10 \u9032\u6570\u306e\u6841\u6570\u304c\u7bc4\u56f2 0-9 \u3092\u8d85\u3048\u3066\u3044\u307e\u3059
91=MQJE050: \u77ed\u7cbe\u5ea6\u30d1\u30c3\u30af 10 \u9032\u6570\u304c\u7bc4\u56f2 (+/-999) \u3092\u8d85\u3048\u3066\u3044\u307e\u3059
92=MQJE051: \u6574\u6570\u30d1\u30c3\u30af 10 \u9032\u6570\u304c\u7bc4\u56f2 (+/-9999999) \u3092\u8d85\u3048\u3066\u3044\u307e\u3059
93=MQJE052: \u9577\u7cbe\u5ea6\u30d1\u30c3\u30af 10 \u9032\u6570\u304c\u7bc4\u56f2 (0+/-999999999999999) \u3092\u8d85\u3048\u3066\u3044\u307e\u3059
94=Websphere MQ Bindings for Java v5.3
95=MQJE053: Websphere MQ Bindings for Java \u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f
96=MQJE054: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u914d\u5e03\u30ea\u30b9\u30c8\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093
97=MQJE055: \u30ad\u30e5\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u30d0\u30fc\u30b8\u30e7\u30f3 2 \u306e Websphere MQ API \u69cb\u9020\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093
98=MQJE056: \u521d\u671f\u6298\u885d\u304c\u5931\u6557\u3057\u307e\u3057\u305f
99=MQJE057: \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u4ea4\u63db\u4e2d\u306b\u30c1\u30e3\u30cd\u30eb\u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f
100=MQJE058: \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u307e\u305f\u306f\u5fdc\u7b54\u30ec\u30b3\u30fc\u30c9\u306e\u6570\u304c\u7121\u52b9\u3067\u3059
101=MQJE059: \u30b9\u30c8\u30ea\u30f3\u30b0\u7d22\u5f15\u30a8\u30e9\u30fc
102=MQJE060: \u30af\u30e9\u30b9 {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f
103=MQJE061: \u30d5\u30a3\u30fc\u30eb\u30c9 {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f
104=MQJE062: \u30e1\u30bd\u30c3\u30c9 {0} \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f
#
# Messages used by MQManagedConnectionJ11, ManagedConnectionFactories
# and MQManagedConnectionMetaData
#
105=MQJI039: ConnectionRequestInfo \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u7121\u52b9\u3067\u3059
106=MQJI040: MQManagedConnection \u306f\u3059\u3067\u306b\u7834\u68c4\u3055\u308c\u3066\u3044\u307e\u3059
107=MQJI041: \u30e1\u30bd\u30c3\u30c9 {0} \u306f Websphere MQ Classes for Java \u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093
108=MQJI042: MQManagedConnection \u306f\u518d\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093
#
# Messages from MQManagedConnectionMetaData
#
109=IBM Websphere MQ
110=\u30b3\u30de\u30f3\u30c9\u30fb\u30ec\u30d9\u30eb {0}
#
# Messages from MQXAi
#
111=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c MQ XA \u30b5\u30dd\u30fc\u30c8\u306e\u30cd\u30a4\u30c6\u30a3\u30d6\u30fb\u30e1\u30bd\u30c3\u30c9\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
112=MQ XA \u30b5\u30dd\u30fc\u30c8\u306e\u30cd\u30a4\u30c6\u30a3\u30d6\u30fb\u30e1\u30bd\u30c3\u30c9\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u306e\u30ed\u30fc\u30c9\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
#
# Messages from MQXAResource
#
113=xa_open \u304c\u5931\u6557\u3057\u307e\u3057\u305f
114=XA \u64cd\u4f5c\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002errorCode \u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044
115=XAResource \u304c\u30af\u30ed\u30fc\u30ba\u3055\u308c\u307e\u3057\u305f

#
# Messages produced by com.ibm.mq.MQMsg2
#
116=MQJE063: \u4e88\u671f\u3057\u306a\u3044\u6587\u5b57\u30bb\u30c3\u30c8 {0}
117=MQJE064: \u30b5\u30dd\u30fc\u30c8\u3055\u308c\u306a\u3044 MQMD \u69cb\u9020\u306e\u30d0\u30fc\u30b8\u30e7\u30f3 {0}
118=MQJE065: \u77db\u76fe\u3057\u305f\u5185\u90e8\u72b6\u6cc1\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f

# message when server doesn't support client XA
119=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u63a5\u7d9a\u3067\u306f XA \u304c\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093

#
# Messages produced via SSL options on a client connection
#
120=MQJE066: {0} \u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u306a\u3044\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30bf\u30a4\u30d7\u3068\u3057\u3066\u63d0\u4f9b\u3055\u308c\u3066\u3044\u307e\u3059
121=MQJE067: \u30d4\u30a2\u540d {0} \u304c\u8981\u6c42\u3055\u308c\u305f\u540d\u524d {1} \u3068\u4e00\u81f4\u3057\u307e\u305b\u3093\u3067\u3057\u305f
122=MQJE068: \u30b5\u30fc\u30d0\u30fc\u8a3c\u660e\u66f8\u304c\u5931\u52b9\u3057\u3066\u3044\u307e\u3059
123=MQJE069: CertStore \u306b\u63a5\u7d9a\u3067\u304d\u307e\u305b\u3093
124=MQJE070: SSL \u30d7\u30ed\u30c8\u30b3\u30eb\u30fb\u30a8\u30e9\u30fc: \u30c1\u30e3\u30cd\u30eb\u304c SSL \u7528\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u307e\u3059\u304b?
