# mqjiEn_US.properties
# Messages produced by the Websphere MQ Java interface classes
# (shared by bindings and by client)
# Messages beginning with MQJI are explanations for exceptions
# Messages beginning with MQJE are errors
#
# From class MQDistributionList
#
1=MQJI001: El objeto del gestor de colas era nulo.
2=MQJI002: No est\u00e1 conectado a un gestor de colas.
3=MQJI003: No se han suministrado registros de objetos.
4=MQJI004: No se han suministrado registros de respuesta.
5=MQJI005: No se han suministrado suficientes registros de respuesta.
6=MQJI006: Un objeto o registro de respuesta era nulo.
7=MQJI007: El par\u00e1metro openResponse era nulo.
8=MQJI008: Se ha pasado un mensaje nulo para su transferencia.
9=MQJI009: Se han pasado opciones de transferencia de mensaje nulas para la transferencia.
10=MQJI010: El n\u00famero de seguidores de mensajes y de registros de respuesta no coincide.
11=MQJI011: La lista de distribuci\u00f3n se ha cerrado.
#
# From class MQEnvironment
#
12=WebSphere MQ Cliente para Java v5.3
#
# From class MQGetMessageOptions
#
13=MQJI013: N\u00famero de versi\u00f3n no soportado - {0}
14=MQJI014: Se han recibido datos insuficientes del gestor de colas.
15=MQJI015: Captador de atenci\u00f3n err\u00f3neo: {0}
#
# From class MQManagedObject
#
16=MQJI016: El objeto se ha cerrado.
17=MQJI017: No se han especificado selectores.
#
# From class MQMD
#
18=MQJI015: Captador de atenci\u00f3n err\u00f3neo: {0}
19=MQJI018: Error de copia de matriz en MQMD
#
# From class MQMessage
#
20=MQJI019: Serie de caracteres UTF mal formada en MQMessage::readLine
21=MQJI020: P\u00e1gina de c\u00f3digos no soportada: {0}
22=MQJI021: Se ha producido un error de \u00edndice de series de caracteres durante la conversi\u00f3n de la p\u00e1gina de c\u00f3digos
23=MQJI015: Captador de atenci\u00f3n err\u00f3neo: {0}
#
# From class MQOD
#
24=MQJI022: El n\u00famero de objetos y de registros de respuestas no coincide.
#
# From class MQPutMessageOptions
#
25=MQJI023: Se ha suministrado un objeto MQMessageTracker nulo.
#
# From class MQMessageTracker
#
26=MQJI024: Error de copia de matriz en MQMessageTracker
#
# From class MQQueue
#
27=MQJI025: Se ha pasado un MQMessage nulo para su obtenci\u00f3n
28=MQJI026: Se han pasado opciones MQGetMessageOptions nulas para la obtenci\u00f3n
29=MQJI027: La cola se ha cerrado
30=MQJI028: Se ha pasado un MQMessage nulo para su transferencia
31=MQJI029: Se han pasado opciones MQPutMessageOptions nulas para la transferencia
#
# From class MQQueueManager
#
32=MQJI030: El gestor de colas no tiene soporte para listas e distribuci\u00f3n.
#
# From class MQS390FloatSupport
#
33=MQJI031: N\u00famero fuera del rango para S/390 flotante de precisi\u00f3n doble
#
# From class MQS390PackedDecimalSupport
#
34=MQJI032: Porci\u00f3n de signo incorrecta en decimal empaquetado
35=MQJI033: D\u00edgito de decimal empaquetado fuera del rango de 0-9
36=MQJI034: Fuera del rango de decimal empaquetado corto (+/-999)
37=MQJI035: Fuera del rango de decimal empaquetado de entero (+/-9999999)
38=MQJI036: Fuera del rango de decimal empaquetado largo (0+/-999999999999999)
#
# From class MQException
#
39=MQJE001: C\u00f3digo de terminaci\u00f3n {0}, Raz\u00f3n {1}
40=MQJE001: Se ha producido una excepci\u00f3n de MQ: C\u00f3digo de terminaci\u00f3n {0}, Raz\u00f3n {1}\n {2}
#
# Messages produced by client only classes...
#
41=MQJI037: Se ha producido un error durante una llamada API de WebSphere MQ - c\u00f3digo de raz\u00f3n {0}
42=MQJI038: Error interno inesperado durante el proceso de un \u00edndice de series de caracteres
43=MQJE002: La corriente de salida del socket era nula
44=MQJE003: Error de E/S al transmitir el almacenamiento intermedio de mensajes
45=MQJE004: La corriente de entrada de entrada del socket era nula
46=MQJE005: No se ha encontrado el captador de atenci\u00f3n TSH. El captador de atenci\u00f3n era {0}
47=MQJE006: Error interno durante copia de matriz
48=MQJE007: Error de E/S al leer datos del mensaje
49=MQJE008: Excepci\u00f3n E/S mientras se enviaba un mensaje de estado
50=MQJE009: No se ha podido crear la cabecera de la API
51=MQJE010: Sistema principal desconocido: {0}
52=MQJE011: Se ha rechazado el intento de conexi\u00f3n con el socket
53=MQJE012: Error de seguridad - no se ha podido conectar con el sistema principal {0}
54=MQJE013: Error al acceder a las corrientes de datos del socket
55=MQJE014: El punto de control ha rechazado la conexi\u00f3n
56=MQJE015: Error al conectar con el punto de control
57=MQJE016: El gestor de colas MQ cerr\u00f3 el canal inmediatamente durante la conexi\u00f3n\n \Motivo del cierre = {0}
58=MQJE017: El gestor de colas MQ ha enviado el error de estado {0} durante la conexi\u00f3n
59=MQJE018: Error de protocolo - se ha recibido un tipo de segmento inesperado
60=MQJE019: Error al crear un segmento de datos inicial
61=MQJE020: CCSID no soportado por el gestor de colas
62=MQJE021: Codificaci\u00f3n no soportada por el gestor de colas
63=MQJE022: Nivel FAP no soportado por el gestores de colas
64=MQJE023: Error de negociaci\u00f3n en el n\u00famero m\u00e1ximo de mensajes por lote
65=MQJE024: Valor de reinicio de secuencia no soportado por el gestor de colas
66=MQJE025: El canal se ha cerrado despu\u00e9s de los dos cambios iniciales. Motivo del cierre {0}
67=MQJE026: El gestor de colas ha enviado el error de estado {0} durante la conexi\u00f3n
68=MQJE027: La rutina de salida de seguridad del gestor de colas ha rechazado la conexi\u00f3n con el c\u00f3digo de error {0}
69=MQJE028: El canal se ha cerrado durante los intercambios de seguridad
70=MQJE029: El gestor de colas ha enviado un tipo de mensaje inesperado
71=MQJE030: Excepci\u00f3n E/S durante los flujos de comunicaciones de seguridad
72=MQJE031: La rutina de salida de seguridad ha cerrado el canal
73=MQJE032: La rutina de salida de seguridad del gestor de colas ha rechazado la conexi\u00f3n con el c\u00f3digo de raz\u00f3n {0}
74=MQJE033: El gestor de colas no ha enviado un flujo de comunicaciones de seguridad necesario
75=MQJE034: El gestor de colas ha enviado un tipo de mensaje inesperado
76=MQJE035: El tama\u00f1o m\u00e1ximo de transmisi\u00f3n negociado es demasiado reducido
77=MQJE036: El gestor de colas ha rechazado el intento de conexi\u00f3n
78=MQJE037: Un gestor de colas remotas ha cerrado la conexi\u00f3n
79=MQJE038: Se ha recibido el tipo de segmento {0} inesperado
80=MQJE039: Excepci\u00f3n E/S mientras se creaba una corriente de datos de conexi\u00f3n
81=MQJE040: La rutina de salida ha cerrado el canal
82=MQJE041: N\u00famero de versi\u00f3n no soportado - (0)
83=MQJE042: Captador de atenci\u00f3n err\u00f3neo: {0}
84=MQJE043: Se han recibido datos insuficientes del gestor de colas
85=MQJE044: Error de copia de matriz en MQMD
86=MQJE045: Serie de caracteres UTF mal formada
87=MQJE046: P\u00e1gina de c\u00f3digos no soportada : {0}
88=MQJE047: Se ha producido un error de \u00edndice de series de caracteres durante la conversi\u00f3n de la p\u00e1gina de c\u00f3digos
89=MQJE048: Porci\u00f3n de signo incorrecta en decimal empaquetado
90=MQJE049: D\u00edgito de decimal empaquetado fuera del rango de 0-9
91=MQJE050: Fuera del rango de decimal empaquetado corto (+/-999)
92=MQJE051: Fuera del rango de decimal empaquetado de entero (+/-9999999)
93=MQJE052: Fuera del rango de decimal empaquetado largo (0+/-999999999999999)
94=WebSphere MQ Enlaces para Java v5.3
95=MQJE053: La biblioteca de WebSphere MQ Enlaces para Java no ha podido cargarse.
96=MQJE054: El gestor de colas no tiene soporte para listas e distribuci\u00f3n.
97=MQJE055: El gestor de colas no tiene soporte para estructuras de API de WebSphere MQ versi\u00f3n 2.
98=MQJE056: Error en negociaci\u00f3n inicial
99=MQJE057: El canal se ha cerrado durante los intercambios de seguridad
100=MQJE058: N\u00famero incorrecto de objetos o registros de respuestas
101=MQJE059: Error de \u00edndice de serie de caracteres
102=MQJE060: No se ha podido encontrar la clase {0}
103=MQJE061: No se ha podido encontrar el campo {0}
104=MQJE062: No se ha podido encontrar el m\u00e9todo {0}
#
# Messages used by MQManagedConnectionJ11, ManagedConnectionFactories
# and MQManagedConnectionMetaData
#
105=MQJI039: Objeto ConnectionRequestInfo no v\u00e1lido
106=MQJI040: MQManagedConnection ya se ha destruido
107=MQJI041: El m\u00e9todo {0} no est\u00e1 soportado por WebSphere MQ Classes por Java
108=MQJI042: MQManagedConnection no puede volver a utilizarse
#
# Messages from MQManagedConnectionMetaData
#
109=IBM WebSphere MQ
110=Nivel de mandato {0}
#
# Messages from MQXAi
#
111=El gestor de seguridad ha impedido acceder a la biblioteca de m\u00e9todos nativos para el soporte de MQ XA.
112=No se ha podido cargar la biblioteca de m\u00e9todos nativos para el soporte de MQ XA.
#
# Messages from MQXAResource
#
113=xa_open no se ha ejecutado correctamente
114=La operaci\u00f3n XA no se ha ejecutado correctamente, consulte el c\u00f3digo de error
115=XAResource est\u00e1 cerrado

#
# Messages produced by com.ibm.mq.MQMsg2
#
116=MQJE063: Juego de caracteres {0} no soportado
117=MQJE064: Versi\u00f3n de la estructura MQMD {0} no soportada
118=MQJE065: Se ha detectado un estado interno incoherente

# message when server doesn't support client XA
119=habilitaci\u00f3n de la conexi\u00f3n de cliente no XA

#
# Messages produced via SSL options on a client connection
#
120=MQJE066: Se ha proporcionado {0} como un tipo de objeto no soportado
121=MQJE067: El nombre de igual {0} no ha coincidido con el nombre solicitado {1}
122=MQJE068: Se ha revocado el certificado del servidor
123=MQJE069: No se puede contactar con el almac\u00e9n de certificados
124=MQJE070: Error del protocolo SSL. \u00bfHa configurado el canal para SSL?
